INSERT INTO artists (name_artist) VALUES
('Zivert'),
('Баста'),
('Би-2'),
('Dabro'),
('Любэ'),
('Татьяна Буланова'),
('Валерий Меладзе');


INSERT INTO albums (name_album, year_album) VALUES
('BESTSELLER', 2021),
('Vinyl #2', 2021),
('Сияй', 2018),
('БАСТА 1', 2006),
('Баста 3', 2010),
('Spirit', 2011),
('Сверим сердца', 2021),
('Наше время', 2014),
('Юность. Deluxe Version', 2020),
('Собрание сочинений. Том 1', 1997),
('Давай за...', 2002),
('Мой сон', 2000),
('Моё русское сердце', 1996),
('Океан', 2005);

INSERT INTO tracks (name_track, time_track, id_album) VALUES
('BESTSELLER', 223220, 1),
('DEL MAR', 220680, 2),
('CRY', 226170, 2),
('Зелёные волны', 223090, 3),
('Ещё хочу', 205450, 3),
('Моя игра', 270460, 4),
('Урбан', 252720, 5),
('Любовь без памяти', 209620, 5),
('Осень', 214450, 4),
('Молитва', 337890, 6),
('Виски', 219750, 7),
('Любовь и ненависть', 374640, 6),
('Нам не нужен герой', 288730, 7),
('Салют', 140610, 8),
('Небо', 169190, 8),
('Юность', 219740, 9),
('Она не такая', 208950, 9),
('Люберцы', 182860, 10),
('Атас', 192600, 10),
('Берёзы', 171890, 11),
('Домой', 202530, 11),
('Мой сон', 301800, 18),
('Ясный мой свет', 197400, 19),
('Береги себя мой ангел', 210600, 20);

INSERT INTO genres (name_genre) VALUES
('Pop'),
('Rap'),
('Rock'),
('Estrade');

INSERT INTO collection (name_collection, year_collection) VALUES
('Хиты 2021', 2021),
('В дорогу', 2020),
('Old hits', 2015),
('Лучший рок', 2020);

INSERT INTO ArtistsAlbums (id_artist, id_album) VALUES
(1, 1),
(1, 2),
(1, 3),
(2, 4),
(2, 5),
(3, 6),
(3, 7),
(4, 8),
(4, 9),
(5, 10),
(5, 11),
(15, 18),
(15, 19),
(16, 20);

INSERT INTO ArtistsGenres VALUES
(1, 1),
(2, 2),
(3, 3),
(4, 1),
(5, 4),
(15, 4),
(16, 4);

INSERT INTO CollectionsTracks VALUES
(1, 1),
(1, 2),
(1, 3),
(1, 11),
(1, 13),
(2, 4),
(2, 13),
(2, 15),
(2, 16),
(2, 17),
(2, 5),
(2, 7),
(2, 8),
(2, 14),
(3, 6),
(3, 9),
(3, 18),
(3, 19),
(3, 20),
(3, 21),
(4, 10),
(4, 11),
(4, 12),
(4, 13),
(3, 31),
(3, 32),
(2, 33),
(3, 33);